// pages/demeanour-detail/demeanour-detail.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        header:{
            title: '风采详情',
            headerbg: '#F5F5F5',
            hiddenBlock: false,
            slot: false
          },
          list:[
              {src:"../../assets/components-image/x1.png",tite1:'风采标题风采标题风采标题',tite2:'学员:李冰冰',
            tite3:'风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详'},
              {src:"../../assets/components-image/x1.png",tite1:'风采标题风采标题风采标题',tite2:'学员:李冰冰',
              tite3:'风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详'
            },
              {src:"../../assets/components-image/x1.png",tite1:'风采标题风采标题风采标题',tite2:'学员:李冰冰',
              tite3:'风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详情风采详情风采详风采详情风采详情风采详情风采详'
            },
          ]
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad: function (options) {

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady: function () {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow: function () {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide: function () {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload: function () {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh: function () {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom: function () {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage: function () {

    }
})